chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mz2048ecm100.h
PLIB_INLINE_API bool PLIB_TMR_ExistsCounterAsyncWriteControl(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsCounterAsyncWriteControl_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_ID_4 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_ID_6 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_ID_8 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_ID_3 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_ID_5 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_ID_7 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_ID_9 :
            return TMR_ExistsCounterAsyncWriteControl_Unsupported(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_TMR_CounterAsyncWriteInProgress(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_CounterAsyncWriteInProgress_Default(index);
        case TMR_ID_2 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_4 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_6 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_8 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_3 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_5 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_7 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_9 :
            return TMR_CounterAsyncWriteInProgress_Unsupported(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsCounterAsyncWriteInProgress(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsCounterAsyncWriteInProgress_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsCounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_4 :
            return TMR_ExistsCounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_6 :
            return TMR_ExistsCounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_8 :
            return TMR_ExistsCounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_3 :
            return TMR_ExistsCounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_5 :
            return TMR_ExistsCounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_7 :
            return TMR_ExistsCounterAsyncWriteInProgress_Unsupported(index);
        case TMR_ID_9 :
            return TMR_ExistsCounterAsyncWriteInProgress_Unsupported(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_TMR_IsPeriodMatchBased(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_IsPeriodMatchBased_Default(index);
        case TMR_ID_2 :
            return TMR_IsPeriodMatchBased_Default(index);
        case TMR_ID_4 :
            return TMR_IsPeriodMatchBased_Default(index);
        case TMR_ID_6 :
            return TMR_IsPeriodMatchBased_Default(index);
        case TMR_ID_8 :
            return TMR_IsPeriodMatchBased_Default(index);
        case TMR_ID_3 :
            return TMR_IsPeriodMatchBased_Default(index);
        case TMR_ID_5 :
            return TMR_IsPeriodMatchBased_Default(index);
        case TMR_ID_7 :
            return TMR_IsPeriodMatchBased_Default(index);
        case TMR_ID_9 :
            return TMR_IsPeriodMatchBased_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsTimerOperationMode(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsTimerOperationMode_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsTimerOperationMode_Default(index);
        case TMR_ID_4 :
            return TMR_ExistsTimerOperationMode_Default(index);
        case TMR_ID_6 :
            return TMR_ExistsTimerOperationMode_Default(index);
        case TMR_ID_8 :
            return TMR_ExistsTimerOperationMode_Default(index);
        case TMR_ID_3 :
            return TMR_ExistsTimerOperationMode_Default(index);
        case TMR_ID_5 :
            return TMR_ExistsTimerOperationMode_Default(index);
        case TMR_ID_7 :
            return TMR_ExistsTimerOperationMode_Default(index);
        case TMR_ID_9 :
            return TMR_ExistsTimerOperationMode_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

#endif
